//HomeWork_Task_2
//Напишите программу, которая на вход принимает два числа и выдает, какое число большее, а какое меньшее

/*Console.WriteLine("Input number_1: ");
int number_1 = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Input number_2: ");
int number_2 = Convert.ToInt32(Console.ReadLine());

if (number_1 > number_2)
{
    Console.WriteLine("Max = " + number_1);
    Console.WriteLine("Min = " + number_2);
}
if (number_1 < number_2)
{
    Console.WriteLine("Max = " + number_2);
    Console.WriteLine("Min = " + number_1);
}
else
{
    Console.WriteLine("Числа равны");
    Console.WriteLine("Max = Min = " + number_1);
}*/




//HomeWork_Task_4
//Напишите программу, которая на вход принимает три числа и выдает максимальное из данных чисел

/*Console.WriteLine("Input number_1: ");
int number_1 = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Input number_2: ");
int number_2 = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Input number_3: ");
int number_3 = Convert.ToInt32(Console.ReadLine());

int max = number_1;

if (number_2 > max)
    max = number_2;
if (number_3 > max)
    max = number_3;

Console.WriteLine("Max = " + max);*/




//HomeWork_Task_6
//Напишите программу, которая на вход принимает число и выдает является ли оно четным

/*Console.WriteLine("Input number: ");
int number = Convert.ToInt32(Console.ReadLine());

if (number%2 == 0)
    Console.WriteLine("Чило четное!!!");
else
    Console.WriteLine("Чило нечетное!!!");*/




//HomeWork_Task_8
//Напишите программу, которая на вход принимает число (N), а на выходе показывает все четные число от 1 до N

/*Console.WriteLine("Input N: ");
int N = Convert.ToInt32(Console.ReadLine());

int index = 2;

while (index <= N)
{
    Console.Write(index + " ");
    index += 2; 
}*/
